export const DressCode = () => {
  return (
    <section className="py-15 bg-white">
      <div className="max-w-6xl mx-auto px-4">
        <div className="mt-12 text-center">
          <div className="bg-gradient-to-r from-pink-100 to-purple-100 rounded-3xl p-6 max-w-2xl mx-auto border border-pink-200">
            <h4 className="text-xl font-semibold text-gray-800 mb-3">
              Дополнительные рекомендации
            </h4>
            <ul className="list-decimal ml-2">
              <li className="mb-4">
                <p className="text-gray-600 text-justify leading-relaxed">
                  Торжественный стиль приветствуется. Дамам рекомендуются платья
                  или элегантные костюмы, мужчинам — костюмы или смарт-кэжуал.
                  Будет прохладно, возьмите легкие пиджаки или накидки.
                </p>
              </li>
              <li className="mb-4">
                <p className="text-gray-600 text-justify leading-relaxed">
                  Цветы прекрасны, но они завянут… А вот бокал хорошего вина
                  (или чего покрепче!) — останется в памяти надолго! Поэтому,
                  если хотите нас порадовать — дарите не букет, а бутылку
                  любимого напитка. Обещаем выпить за вас или с вами 😍 — с
                  теплом и благодарностью!
                </p>
              </li>
            </ul>
          </div>
        </div>
      </div>
    </section>
  );
};
